Repository: Felienne/hedy-web-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: el, nb_no

# template_code
source: This is the explanation of my adventure! This way I can show a command: <code>{print}</code> But sometimes I might want to show a piece of code, like this: <pre> {ask} What's your name? {echo} so your name is </pre>
el: Αυτή είναι η εξήγηση της περιπέτειάς μου! Με αυτόν τον τρόπο μπορώ να δείξω μια εντολή: <code>print</code> Αλλά μερικές φορές μπορεί να θέλω να δείξω ένα κομμάτι κώδικα, όπως αυτό: <pre> ask Ποιο έιναι το όνομά σου; echo άρα το όνομά σου είναι </pre>
nb_no: Dette er forklaringen for eventyret mitt! På denne måten kan jeg vise en kommando: <code>skriv</code> Men noen ganger ønsker jeg å vise en kodesnutt, som dette: <pre> spør Hva er navnet ditt? ekko så navnet ditt er </pre>

# adventure_terms
source: I agree that my adventure might be made publicly available on Hedy.
el: Συμφωνώ ότι η περιπέτειά μου μπορεί να γίνει δημόσια διαθέσιμη στο Hedy.
nb_no: Jeg tillater at eventyret mitt kan offentliggjøres på Hedy.

source: Preview
el: Προεπισκόπηση
nb_no: Forhåndsvis

source: Save
el: Αποθήκευση
nb_no: Lagre

# delete_adventure_prompt
source: Are you sure you want to remove this adventure?
el: Είσαι σίγουρος ότι θέλεις να διαγράψεις την περιπέτεια;
nb_no: Er du sikker på at du vil fjerne dette eventyret?

# customize_class_exp_1
source: Hi! On this page you can customize your class. By selecting levels and adventures you can choose what your student can see. You can also add your own created adventures to levels. All levels and default adventures will be selected by default. <b>Notice:</b> Not every adventure is available for every level! Settings up your customizations goes as follows:
nb_no: Hei! På denne siden kan du tilpasse innstillingene for klassen din. Du kan velge hva elevene dine skal kunne se ved å velge nivåer og eventyr. Som standard vil alle nivåer og standardeventyr vil være valgt. Du kan også legge til dine egne eventyr til nivåer. <b>Merk:</b> Det er ikke alle eventyr som er tilgjengelig for alle nivåer. For å tilpasse innstillingene kan du gjøre slik:

# customize_class_step_1
source: Select levels for your class by pressing the "level buttons"
el: Επίλεξε επίπεδα για την τάξη σου πατώντας το "κουμπιά επιπέδων"
nb_no: Velg nivåer for klassen din ved å trykke på "Nivå knappenene"

# customize_class_step_2
source: "Checkboxes" will appear for the adventures available for the chosen levels
el: Θα εμφανιστούν "Πλαίσια ελέγχου" για τις περιπέτειες που είναι διαθέσιμες για τα επιλεγμένα επίπεδα
nb_no: "Avkrysningsbokser" vil dukke opp for eventyrene som er tilgjengelig for de valgte nivåene

# customize_class_step_3
source: Select the adventures you want to make available
el: Επίλεξε τις περιπέπτειες που θέλεις να κάνεις διαθέσιμες
nb_no: Velg hvilke eventyr du ønsker at skal være tilgjengelig

# customize_class_step_4
source: Click the name of an adventure to (de)select for all levels
el: Κάνε κλικ στο όνομα μιας περιπέτειας για να την (απ)επιλέξεις για όλα τα επίπεδα
nb_no: Trykk på navnet til et eventyr for å legge til eller fjerne det for alle nivåer

# customize_class_step_5
source: Add personal adventures
el: Προσθήκη προσωπικών περιπετειών
nb_no: Legg til dine egne eventyr

# customize_class_step_6
source: Selecting an opening date for each level (you can also leave it empty)
el: Επιλογή ημερομηνίας έναρξης για κάθε επίπεδο (μπορείς επίσης να το αφήσεις κενό)
nb_no: Velg en dato for når hvert nivå skal gjøres tilgjengelig (du kan også la feltene være tomme)

# customize_class_step_7
source: Selection other settings
el: Επιλογή άλλων ρυθμίσεων
nb_no: Velg resten av innstillingene

# customize_class_step_8
source: Choose "Save" -> You're done!
el: Επίλεξε "Αποθήκευση" -> Ολοκλήρωσες!
nb_no: Trykk "Lagre" -> Så er du ferdig!

# customize_class_exp_2
source: You can always change these settings later on. For example, you can make specific adventures or levels available while teaching a class. This way it's easy for you to determine which level and adventures your students will be working on. If you want to make everything available for your class it is easiest to remove the customization all together.
nb_no: Du kan alltids komme tilbake senere og endre disse innstillingene. Du kan for eksempel gjøre spesifikke evntyr og nivåer tilgjengelig når du underviser en klasse. På denne måten er det lett for deg å bestemme hvilke nivåer og eventyr elevene dine skal jobbe med. Hvis du har lyst til å gjøre alt tilgjengelig for klassen din, er det lettest å bare fjerne alle tilpasningene du har gjort.

source: Select adventures
el: Επίλεξε περιπέτειες
nb_no: Velg eventyr

source: Opening dates
el: Ημερομηνίες έναρξης λειτουργίας
nb_no: Dato for tilgjengeliggjøring

source: Opening date
el: Ημερομηνία έναρξης λειτουργίας
nb_no: Dato for tilgjengeliggjøring

# directly_available
source: Directly open
el: Άμεσα ανοιχτό
nb_no: Åpne på direkten

source: Select own adventures
el: Επίλεξε τις δικές σου περιπέτειες
nb_no: Velg egne eventyr

source: Select
el: Επίλεξε
nb_no: Velg

source: Other settings
el: Άλλες ρυθμίσεις
nb_no: Andre innstillinger

source: Option
el: Επιλογή
nb_no: Valg

# mandatory_mode
source: Mandatory developer's mode
el: Υποχρεωτική λειτουργία προγραμματιστή
nb_no: Obligatorisk utviklermodus

source: Hide cheatsheet
el: Απόκρυψη των σημειώσεων
nb_no: Skjul hjelpeark

source: Hide keyword switcher
nb_no: hide keyboard switcher

# reset_adventure_prompt
source: Are you sure you want to reset all selected adventures?
el: Είσαι βέβαιος ότι θέλεις να επαναφέρεις όλες τις επιλεγμένες περιπέτειες;
nb_no: Er du sikker på at du vil tilbakestille alle valgte eventyr?

# reset_adventures
source: Reset selected adventures
el: Επανάφερε επιλεγμένες περιπέτειες
nb_no: Tilbakestill valgte eventyr

# remove_customizations_prompt
source: Are you sure you want to remove this class's customizations?
el: Είσαι βέβαιος ότι θέλεις να καταργήσεις τις προσαρμογές αυτής της τάξης;
nb_no: Er du sikker på at du vil fjerne tilpasningene for denne klassen?

source: Remove customization
el: Κατάργηση προσαρμογής
nb_no: Fjern tilpasninger

# go_back_to_main
source: Go back to main page
el: Πήγαινε πίσω στην κεντρική σελίδα
nb_no: Gå tilbake til hovedsiden

source: Explore programs
el: Εξερεύνηση προγραμμάτων
nb_no: Utforsk programmer

# explore_explanation
source: On this page you can look through programs created by other Hedy users. You can filter on both a Hedy level and adventure. Click on "View program" to open a program and run it. Programs with a red header contain a mistake. You can still open the program, but running it will result in an error. You can of course try to fix it! If the creator has a public profile you can click their username to visit their profile. There you will find all their shared programs and much more!
el: Σε αυτή τη σελίδα μπορείς να δεις προγράμματα που έχουν δημιουργηθεί από άλλους χρήστες του Hedy. Μπορείς να φιλτράρεις σύμφωνα με επίπεδο Hedy όσο και με επίπεδο περιπέτειας. Κάνε κλικ στο "Προβολή προγράμματος" για να ανοίξεις ένα πρόγραμμα και εκτέλεσέ το. Τα προγράμματα με κόκκινη κεφαλίδα περιέχουν ένα λάθος. Μπορείς ακόμα να ανοίξεις το πρόγραμμα, αλλά η εκτέλεσή του θα οδηγήσει σε σφάλμα. Μπορείς φυσικά να προσπαθήσεις να το διορθώσεις! Εάν ο δημιουργός έχει δημόσιο προφίλ, μπορείς να κάνεις κλικ στο όνομα χρήστη του για να επισκεφτείς το προφίλ του. Εκεί θα βρεις όλα τα κοινά τους προγράμματα και πολλά άλλα!
nb_no: På denne siden kan du se gjennom programmer laget av andre Hedybrukere. Du kan filtrere på både Hedy nivå og eventyr. Trykk på "Se program" for å åpne programmet og kjøre det. Program med en rød overskrift inneholder en feil. Du kan fortsatt åpne programmet, men når du kjører det vil du få en feil. Du kan selvfølgelig prøve å fikse feilen! Hvis personen som har laget programmet har en offentlig profil så kan du trykke på brukernavnet for å besøke profilen. På profilen vil du finne alle programmene de har delt og mye annet!

source: Creator
el: Δημιουργός
nb_no: Skaper

source: View program
el: Προβολή προγράμματος
nb_no: Se program

source: My classes
el: Οι τάξεις μου
nb_no: Mine klasser

source: students
el: μαθητών
nb_no: elever

source: View
el: Προβολή
nb_no: Se

# delete_class_prompt
source: Are you sure you want to delete the class?
el: Είσαι βέβαις/α ότι θέλεις να διαγράψεις την τάξη;
nb_no: Er du sikker på at du vil slette klassen?

# create_class
source: Create a new class
el: Δημιουργία νέας τάξης
nb_no: Opprett en ny klasse

source: My adventures
el: Οι περιπέτειές μου
nb_no: Mine eventyr

source: Last update
el: Τελευταία ενημέρωση
nb_no: Sist oppdatert

# adventure_prompt
source: Please enter the name of the adventure
el: Παρακαλώ δώσε το όνομα της περιπέτειας
nb_no: Vennligst skriv inn navnet på eventyret

source: Create adventure
el: Δημιουργία περιπέτειας
nb_no: Opprett eventyr

# teacher_welcome
source: Welcome to Hedy! Your are now the proud owner of a teachers account which allows you to create classes and invite students.
el: Καλώς ήρθες στη Hedy! Είσαι πλέον περήφανος κάτοχος ενός λογαριασμού καθηγητή που σου επιτρέπει να δημιουργείς μαθήματα και να προσκαλείς μαθητές.
nb_no: Velkommen til Hedy! Du er nå den stolte eier av en lærerkonto som gir deg muligheten til å lage klasser og invitere elever.

source: achievements
el: επιτεύγματα
nb_no: prestasjoner

# last_achievement
source: Last earned achievement
el: Πρόσφατο επίτευγμα
nb_no: Nyeste prestasjon

# specific_adventure_mode
source: You're currently in adventure '{adventure}', click on 'Hedy' to view all adventures.
nb_no: Du er for øyeblikket i eventyret '{adventure}', trykk på 'Hedy' for å se alle eventyr.

# example_code_header
source: Example Hedy Code
el: Παράδειγμα κώδικα Hedy
nb_no: Eksempel Hedykode

# enter_text
source: Enter your answer here...
el: Γράψε την απάντηση εδώ...
nb_no: Skriv inn svaret ditt her...

source: Enter
el: Είσοδος
nb_no: Send inn

# run_code_button
source: Run code
el: Εκτέλεσε κώδικα
nb_no: Kjør kode

# edit_code_button
source: Edit code
el: Επεξεργασία κώδικα
nb_no: Endre kode

# delete_confirm
source: Are you sure you want to delete the program?
el: Είσαι βέβαιος/α ότι θέλεις να διαγράψεις το πρόγραμμα;
nb_no: Er du sikker på at du vil slette dette programmet?

source: Delete
el: Διαγραφή
nb_no: Slett

# read_code_label
source: Read aloud
el: Εκφωνούν
nb_no: Les høyt

# regress_button
source: Go back to level {level}
el: Επιστροφή στο επίπεδο {level}
nb_no: Gå tilbake til nivå {level}

# advance_button
source: Go to level {level}
el: Πήγαινε στο επίπεδο {level}
nb_no: Gå til nivå {level}

# developers_mode
source: Programmer's mode
el: Λειτουργία προγραμματιστή
nb_no: Programmeringsmodus

# nav_start
source: Home
el: Αρχική
nb_no: Hjem

# nav_explore
source: Explore
el: Εξερεύνηση
nb_no: Utforsk

# nav_learn_more
source: Learn more
el: Μάθε περισσότερα
nb_no: Lær mer

# program_header
source: My programs
el: Τα προγράμματά μου
nb_no: Mine programmer

source: My achievements
el: Τα επιτεύγματά μου
nb_no: Mine prestasjoner

source: My account
el: Ο λογαριασμός μου
nb_no: Min konto

source: For teachers
el: Για καθηγητές
nb_no: For lærere

source: Log out
el: Αποσύνδεση
nb_no: Logg ut

source: Log in
el: Σύνδεση
nb_no: Logg inn

source: Search...
el: Αναζήτηση...
nb_no: Søk...

# amount_created
source: programs created
el: προγράμματα που δημιουργήθηκαν
nb_no: programmer opprettet

# amount_saved
source: programs saved
el: αποθηκευμένα προγράμματα
nb_no: programmer lagret

# amount_submitted
source: programs submitted
el: υποβληθέντα προγράμματα
nb_no: programmer sendt inn

source: Cancel
el: Ακύρωση
nb_no: Avbryt

source: Copy link to share
el: Αντίγραψε τον σύνδεσμο για κοινή χρήση
nb_no: Kopier lenken for å dele

# achievement_earned
source: You've earned an achievement!
el: Κέρδισες ένα επίτευγμα!
nb_no: Du oppnådde en prestasjon!

# mailing_title
source: Subscribe to the Hedy newsletter
el: Εγγραφή για Hedy newsletter
nb_no: Abonner på nyhetsbrevet fra Hedy

source: Email
nb_no: E-post

# surname
source: First Name
el: Μικρό Όνομα
nb_no: Fornavn

source: Last Name
el: Επίθετο
nb_no: Etternavn

source: Country
el: Χώρα
nb_no: Land

source: Subscribe
el: Εγγραφή
nb_no: Abonner

# required_field
source: Fields marked with an * are required
el: Τα πεδία με * απαιτείται να συμπληρωθούν
nb_no: Felter merket med en * er påkrevd

# previous_campaigns
source: View previous campaigns
nb_no: Se tidligere kampanjer

# step_title
source: Assignment
el: Άσκηση
nb_no: Oppgave

# save_code_button
source: Save code
el: Αποθήκευσε κώδικα
nb_no: Lagre kode

# share_code_button
source: Save & share code
el: Αποθήκευσε και μοιράσου κώδικα
nb_no: Lagre og del koden

# try_button
source: Try
el: Δοκίμασε το
nb_no: Prøv

# login_long
source: Log in to your account
el: Συνδέσου στο λογαριασμό σου
nb_no: Logg inn på kontoen din

source: No account?
el: Ακόμα χωρίς λογαριασμό;
nb_no: Ingen konto?

source: Create account
el: Δημιουργία λογαριασμού
nb_no: Opprett konto

# forgot_password
source: Forgot your password?
el: Ξέχασες το συνθηματικό σου;
nb_no: Glemt passord?

# main_subtitle
source: A gradual programming language
el: Μια βαθμιαία γλώσσα προγραμματισμού
nb_no: Et gradvis programmeringsspråk

source: Try it
el: Δοκίμασέ τη
nb_no: Prøv det

source: Account overview
el: Σύνοψη λογαριασμού
nb_no: Kontooversikt

source: My messages
el: Τα μηνύματά μου
nb_no: Mine meldinger

# invite_message
source: You have received an invitation to join class
el: Έλαβες μια πρόσκληση για να συμμετάσχεις στην τάξη
nb_no: Du har mottatt en invitasjon til å bli med i en klasse

# sent_by
source: This invitation is sent by
el: Αυτή η πρόσκληση εστάλη από
nb_no: Invitasjonen ble sendt av

# delete_invite
source: Delete invitation
el: Διαγραφή πρόσκλησης
nb_no: Slett invitasjon

source: Public profile
el: Δημόσιο προφίλ
nb_no: Offentlig profil

source: Profile picture
el: Εικόνα προφίλ
nb_no: Profilbilde

source: Personal text
el: Προσωπικό κείμενο
nb_no: Personlig tekst

source: Your personal text...
el: Το προσωπικό σου κείμενο...
nb_no: Din personlige tekst...

source: Favourite program
el: Αγαπημένο πρόγραμμα
nb_no: Favorittprogram

# public_profile_info
source: By selecting this box I make my profile visible for everyone. Be careful not to share personal information like your name or home address, because everyone will be able to see it!
el: Επιλέγοντας αυτό το πλαίσιο κάνω το προφίλ μου ορατό σε όλους. Πρόσεξε να μην κοινοποιείς προσωπικές πληροφορίες όπως το όνομα ή τη διεύθυνση του σπιτιού σου, γιατί θα μπορούν να τα δουν όλοι!
nb_no: Ved å huke av i denne boksen gjør jeg profilen min synlig for alle. Vær forsiktig slik at du ikke deler personlig informasjon som navnet ditt eller adressen din, fordi alle vil kunne se det!

# update_public
source: Update public profile
el: Ενημέρωση δημόσιου προφίλ
nb_no: Oppdater offentlig profil

# are_you_sure
source: Are you sure? You cannot revert this action.
el: Είσαι σίγουρος/η; Δεν μπορείς να αναιρέσεις αυτήν την ενέργεια.
nb_no: Er du sikker? Du kan ikke angre på denne handlingen.

# delete_public
source: Delete public profile
el: Διαγραφή δημόσιου προφίλ
nb_no: Slett offentlig profil

# self_removal_prompt
source: Are you sure you want to leave this class?
el: Είστε βέβαιος/α ότι θέλεις να αποχωρήσεις από αυτήν την τάξη;
nb_no: Er du sikker på at du vil forlate denne klassen?

source: Leave class
el: Έξοδος από την τάξη
nb_no: Forlat klassen

# settings
source: My personal settings
el: Οι προσωπικές μου ρυθμίσεις
nb_no: Mine personlige innstillinger

source: Birth year
el: Έτος γέννησης
nb_no: Fødselsår

source: Preferred language
el: Προτιμώμενη γλώσσα
nb_no: Foretrukket språk

source: Preferred keyword language
el: Προτιμώμενη γλώσσα για τα keywords
nb_no: Fortrukket språk for nøkkelord

source: Gender
el: Φύλο
nb_no: Kjønn

source: Female
el: Γυναίκα
nb_no: Jente

source: Male
el: Άνδρας
nb_no: Gutt

source: Other
el: Άλλο
nb_no: Annet

source: Update profile
el: Ενημέρωση προφίλ
nb_no: Oppdater profil

# destroy_profile
source: Delete profile
el: Μόνιμη διαγραφή λογαριασμού
nb_no: Slett profil

source: Change password
el: Άλλαξε συνθηματικό
nb_no: Endre passord

source: New password
el: Νέο συνθηματικό
nb_no: Nytt passord

source: Repeat new password
el: Επανάλαβε το νέο συνθηματικό
nb_no: Gjenta nytt passord

# recent
source: My recent programs
el: Τα πρόσφατα προγράμματά μου
nb_no: Mine siste programmer

# submitted_header
source: This is a submitted program and can't be altered.
el: Αυτό είναι ένα υποβληθέν πρόγραμμα και δεν μπορεί να τροποποιηθεί
nb_no: Dette programmet har blitt sendt inn og kan ikke endres.

source: Title
el: Τίτλος
nb_no: Tittel

source: Last edited
el: Τελευταία επεξεργασία
nb_no: Sist endret

# favourite_confirm
source: Are you sure you want to set this program as your favourite?
el: Είσαι βέβαιος/α ότι θέλεις να ορίσεις αυτό το πρόγραμμα ως το αγαπημένο σου;
nb_no: Er du sikker på at du vil velge dette som ditt favorittprogram?

source: Open
el: Άνοιγμα
nb_no: Åpne

# copy_clipboard
source: Successfully copied to clipboard
el: Αντιγράφηκε με επιτυχία στο πρόχειρο
nb_no: Kopiert til utklippstavlen

# unshare_confirm
source: Are you sure you want to make the program private?
el: Είσαι σίγουρος ότι θέλεις να κάνεις το πρόγραμμα ιδιωτικό;
nb_no: Er du sikker på at du vil gjøre dette til et privat program?

source: Unshare
el: Κατάργηση κοινής χρήσης
nb_no: Angre deling

# submit_warning
source: Are you sure you want to submit this program?
el: Είσαι σίγουρος ότι θέλεις να υποβάλεις αυτό το πρόγραμμα;
nb_no: Er du sikker på at du vil sende inn dette programmet?

# submit_program
source: Submit
el: Υποβολή
nb_no: Send inn

# share_confirm
source: Are you sure you want to make the program public?
el: Είσαι σίγουρος ότι θέλεις να δημοσιοποιήσεις το πρόγραμμα;
nb_no: Er du sikker på at du vil gjøre dette til et offentlig synlig program?

source: Share
el: Μοίρασμα
nb_no: Del

# no_programs
source: You have no programs yet.
el: Δεν έχεις προγράμματα ακόμα.
nb_no: Du har ingen programmer enda.

# write_first_program
source: Write your first program!
el: Γράψε το πρώτο σου πρόγραμμα!
nb_no: Lag ditt første program!

# no_shared_programs
source: has no shared programs...
el: δεν έχει κοινά προγράμματα...
nb_no: har ingen delte programmer...

# go_to_first_question
source: Go to question 1
el: Πήγαινε στην ερώτηση 1
nb_no: Gå til spørsmål 1

source: Question
el: Ερώτηση
nb_no: Spørsmål

# submit_answer
source: Answer question
el: Απάντησε στην ερώτηση
nb_no: Svar på spørsmål

# feedback_success
source: Good!
el: Μπράβο!
nb_no: Bra!

# feedback_failure
source: Wrong!
el: Λάθος!
nb_no: Feil!

# correct_answer
source: The correct answer is
el: Σωστό
nb_no: Det rette svaret er

source: Go to question
el: Πήγαινε στην ερώτηση
nb_no: Gå til spørsmål

source: Go to quiz result
el: Πήγαινε στο αποτέλεσμα του κουίζ
nb_no: Gå til quiz oppsummeringen

# end_quiz
source: Quiz end
el: Τέλος του κουίζ
nb_no: Slutt på quizen

source: Score
el: Σκορ
nb_no: Poengsum

# recover_password
source: Request a password reset
el: Ζήτησε επαναφορά συνθηματικού
nb_no: Be om at passordet tilbakestilles

# send_password_recovery
source: Send me a password recovery link
el: Στείλε μου ένα σύνδεσμο για ανάκτηση συνθηματικού
nb_no: Send meg en tilbakestillingslenke for passordet mitt

source: Reset password
el: Επαναφορά συνθηματικού
nb_no: Tilbakestill passord

# password_repeat
source: Repeat password
el: Επανάλαβε το συνθηματικό
nb_no: Gjenta passord

# create_account_explanation
source: Having your own account allows you to save your programs.
el: Το να έχεις το δικό σου λογαριασμό, σου επιτρέπει να αποθηκεύεις τα προγράμματά σου.
nb_no: Med en egen konto kan du lagre programmene dine.

# programming_experience
source: Do you have programming experience?
el: Έχεις εμπειρία στον προγραμματισμό;
nb_no: Har du programmeringserfaring?

# languages
source: Which of these programming languages have you used before?
el: Ποιες από αυτές τις γλώσσες προγραμματισμού έχεις χρησιμοποιήσει στο παρελθόν;
nb_no: Hvilke av disse programmeringsspråkene har du brukt før?

# other_block
source: Another block language
el: Άλλη γλώσσα με πλακίδια
nb_no: Et annet blokk-språk

# other_text
source: Another text language
el: Άλλη γλώσσα με κείμενο
nb_no: Et annet tekstspråk

# request_teacher
source: Would you like to apply for a teacher's account?
el: Θα ήθελες να κάνεις αίτηση για λογαριασμό καθηγητή;
nb_no: Vil du søke om lærerkonto?

# subscribe_newsletter
source: Subscribe to the newsletter
el: Εγγραφή στο newsletter
nb_no: Abonner på nyhetsbrevet

# agree_with
source: I agree to the
el: Συμφωνώ με το
nb_no: Jeg godkjenner

source: privacy terms
el: Απόρρητο και Όροι
nb_no: personvernsvilkårene

# agree_third_party
source: I consent to being contacted by partners of Leiden University with sales opportunities (optional)
el: Συμφωνώ να επικοινωνήσουν μαζί μου συνεργάτες του Leiden University με ευκαιρίες πωλήσεων (προαιρετικό)
nb_no: Jeg godkjenner å bli kontaktet av partnere av Leiden Universitet med markedsføring (valgfritt)

# already_account
source: Already have an account?
el: Έχεις ήδη λογαριασμό;
nb_no: Har du allerede en konto?

# teacher_invitation_require_login
source: To set up your profile as a teacher, we will need you to log in. If you don't have an account, please create one.
el: Για να ρυθμίσεις το προφίλ σου ως καθηγητής, θα χρειαστεί να συνδεθείς. Εάν δεν έχεις λογαριασμό, δημιούργησε έναν.
nb_no: For å sette opp profilen din som en lærer må du logge inn. Hvis du ikke har en konto, vennligst lag en.

source: by
nb_no: av

# title_admin
source: Hedy - Administrator page
nb_no: Hedy - Administrator side

# username_invalid
source: Your username is invalid.
el: Το όνομα χρήστη δεν είναι έγκυρο
nb_no: Ditt brukernavn er ugylidig.

# username_special
source: Username cannot contain `:` or `@`.
el: To όνομα χρήστη δεν μπορεί να περιέχει `:` ή `@`.
nb_no: Brukernavnet kan ikke inneholde `:` eller `@`.

# username_three
source: Username must contain at least three characters.
el: Το όνομα χρήστη πρέπει να περιέχει τουλάχιστον τρείς χαρακτήρες.
nb_no: Brukernavnet må være *minst* tre bokstaver langt.

# password_invalid
source: Your password is invalid.
el: Το συνθηματικό σου δεν είναι έγκυρο
nb_no: Passordet ditt er ugyldig.

# passwords_six
source: All passwords need to be six characters or longer.
el: Όλα τα συνθηματικά πρέπει να έχουν 6 χαρακτήρες ή περισσότερους.
nb_no: Alle passord må være *minst* seks tegn langt.

# email_invalid
source: Please enter a valid email.
el: Παρακαλώ να εισάγεις ένα έγκυρο email.
nb_no: Vennligst fyll inn en gylid epost.

source: Invalid username/password.
el: Μη έγκυρο όνομα χρήστη/συνθηματικό.
nb_no: Ugyldig brukernavn/passord.

# repeat_match_password
source: The repeated password does not match.
el: Το συνθηματικό που επανέλαβες δεν ταιριάζει.
nb_no: Passordene du fylte inn er ikke like.

# language_invalid
source: Please select a valid language.
el: Παρακαλώ διάλεξε μια έγκυρη γλώσσα
nb_no: Vennligst velg et gylid språk.

# agree_invalid
source: You have to agree with the privacy terms.
el: Πρέπει να συμφωνήσεις με το απόρρητο και τους όρους
nb_no: Du må godkjenne personvernsvilkårene.

# keyword_language_invalid
source: Please select a valid keyword language (select English or your own language).
el: Επίλεξε μια έγκυρη γλώσσα λέξεων-κλειδιών (επιλέξτε Αγγλικά ή τη δική σας γλώσσα)
nb_no: Vennligst velg et gyldig språk for nøkkelord (velg ditt eget språk eller engelsk).

# year_invalid
source: Please enter a year between 1900 and {current_year}.
el: Παρακαλώ να εισάγεις ένα έτος ανάμεσα στο 1900 και {current_year}
nb_no: Vennligst fyll inn et år mellom 1900 og {current_year}.
