Repository: Felienne/hedy-web-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: el, nb_no

# gender_invalid
source: Please select a valid gender, choose (Female, Male, Other).
el: Παρακαλώ διάλεξε ένα έγκυρο φύλο, επίλεξε (Γυναίκα, Άνδρας, Άλλο)
nb_no: Vennligst velg et gyldig kjønn (jente, gutt, annet).

# country_invalid
source: Please select a valid country.
nb_no: Vennligst velg et gyldig land.

# experience_invalid
source: Please select a valid experience, choose (Yes, No).
el: Παρακαλώ διάλεξε μια έγκυρη εμπειρία, επίλεξε (Ναι, Όχι)
nb_no: Vennligst velg svar på spørsmål om programmeringserfaring (Ja/Nei).

# programming_invalid
source: Please select a valid programming language.
el: Παρακαλώ διάλεξε μια έγκυρη γλώσσα προγραμματισμού
nb_no: Vennligst velg et gyldig programmeringsspråk.

# exists_username
source: That username is already in use.
el: Αυτό το όνομα χρήστη χρησιμοποιείται ήδη.
nb_no: Brukernavn er allerede i bruk.

# exists_email
source: That email is already in use.
el: Αυτό το email χρησιμοποιείται ήδη.
nb_no: Eposten er allerede i bruk.

# token_invalid
source: Your token is invalid.
el: Το διακριτικό σου δεν είναι έγκυρο
nb_no: Ugylig token.

# password_six
source: Your password must contain at least six characters.
el: Το συνθηματικό πρέπει να περιέχει τουλάχιστον έξι χαρακτήρες.
nb_no: Passordet ditt må inneholde minst seks tegn.

# password_change_not_allowed
source: You're not allowed to change the password of this user.
el: Δεν επιτρέπεται να αλλάξεις το συνθηματικό αυτού του χρήστη
nb_no: Du har ikke lov til å endre passordet til denne brukeren.

# password_change_success
source: Password of your student is successfully changed.
el: Το συνθηματικό του μαθητή σου άλλαξε με επιτυχία
nb_no: Passordet til eleven din ble endret.

source: Password updated.
el: Το συνθηματικό ενημερώθηκε.
nb_no: Passord oppdatert.

# profile_updated_reload
source: Profile updated, page will be re-loaded.
el: Το προφίλ ενημερώθηκε, η σελίδα θα ανανεωθεί.
nb_no: Profil oppdatert, siden lastes på nytt.

source: Profile updated.
el: Το προφίλ ενημερώθηκε.
nb_no: Profil oppdatert.

# sent_password_recovery
source: You should soon receive an email with instructions on how to reset your password.
el: Σύντομα θα λάβεις ένα email με οδηγίες για το πώς να επαναφέρεις το συνθηματικό σου.
nb_no: Du vil snart motta en epost med instruksjoner om hvordan du tilbakestiller passordet ditt.

# password_resetted
source: Your password has been successfully reset. You are being redirected to the login page.
el: Έγινε επιτυχής επαναφορά του συνθηματικού σου. Θα ανακατευθυνθείς στη σελίδα σύνδεσης.
nb_no: Passordet har blitt tilbakestilt. Du blir nå sendt til logg-inn siden.

# teacher_invalid
source: Your teacher value is invalid.
el: Η βαθμίδα καθηγητή δεν είναι έγκυρη
nb_no: Lærer-verdien din er ugyldig.

# delete_success
source: Program deleted successfully.
el: Το πρόγραμμα διαγράφηκε με επιτυχία
nb_no: Programmet ble slettet.

# save_prompt
source: You need to have an account to save your program. Would you like to login now?
el: Πρέπει να έχεις ένα λογαριασμό για να αποθηκεύσεις το πρόγραμμά σου. Θα ήθελες να συνδεθείς τώρα;
nb_no: Du må ha en konto for å lagre programmet ditt. Vil du logge inn nå?

# overwrite_warning
source: You already have a program with this name, saving this program will replace the old one. Are you sure?
el: Έχεις ήδη ένα πρόγραμμα με αυτό το όνομα, η αποθήκευση αυτού του προγράμματος θα αντικαταστήσει το παλιό. Είσαι σίγουρος/η?
nb_no: Du har allerede et program med dette navnet. Hvis du lagrer programmet vil det overskrive det gamle, er du sikker?

# save_parse_warning
source: This program contains an error, are you sure you want to save it?
nb_no: Programmet inneholder en feil, er du sikker på at du vil lagre det?

# save_success_detail
source: Program saved successfully.
el: Το πρόγραμμα αποθηκεύτηκε επιτυχώς
nb_no: Programmet ble lagret.

# share_success_detail
source: Program shared successfully.
el: Το πρόγραμμα μοιράστηκε με επιτυχία
nb_no: Programmet ble delt.

# unshare_success_detail
source: Program unshared successfully.
el: Το πρόγραμμα καταργήθηκε με επιτυχία
nb_no: Programmet er ikke lengre delt.

# favourite_success
source: Your program is set as favourite.
el: Το πρόγραμμά σου έχει οριστεί ως αγαπημένο
nb_no: Programmet er nå ditt favorittprogram.

# level_invalid
source: This Hedy level in invalid.
el: Αυτό το επίπεδο Hedy δεν είναι έγκυρο
nb_no: Dette Hedynivået er ugyldig.

# retrieve_class_error
source: Only teachers can retrieve classes
el: Μόνο οι καθηγητές μπορούν να ανακτήσουν τις τάξεις
nb_no: Kun lærere kan hente info om klasser

# no_such_class
source: No such Hedy class.
el: Δεν υπάρχει τέτοια τάξη Hedy!
nb_no: Denne Hedy-klassen fins ikke

# title_class statistics
source: My statistics
nb_no: Min statistikk

# title_class-overview
source: Hedy - Class overview
nb_no: Hedy - Klasseoversikt

# only_teacher_create_class
source: Only teachers are allowed to create classes!
nb_no: Kun lærere kan opprette klasser!

# class_name_invalid
source: This class name is invalid.
nb_no: Klassenavnet er ugyldig.

# class_name_empty
source: You didn't enter a class name!
el: Δεν δώσατε όνομα τάξης!
nb_no: Du skrev ikke inn et klassenavn!

# class_name_duplicate
source: You already have a class with this name.
el: Έχεις ήδη μια τάξη με αυτό το όνομα!
nb_no: Du har allerede en klasse med dette navnet.

# invalid_class_link
source: Invalid link for joining the class.
el: Μη έγκυρος σύνδεσμος για συμμετοχή στην τάξη.
nb_no: Ugyldig lenke for å bli med i klassen.

# title_join-class
source: Hedy - Join class
nb_no: Hedy - Bli med i klassen

# title_customize-class
source: Hedy - Customize class
nb_no: Hedy - Tilpass klasse

# customization_deleted
source: Customizations successfully deleted.
el: Οι προσαρμογές διαγράφησαν με επιτυχία.
nb_no: Tilpassningene ble slettet.

# class_customize_success
source: Class successfully customized.
el: Η τάξη προσαρμόστηκε με επιτυχία.
nb_no: Tilpassningene ble lagret.

# username_empty
source: You didn't enter an username!
el: Δεν έδωσες όνομα χρήστη!
nb_no: Du skrev ikke inn et brukernavn!

# student_not_existing
source: This username doesn't exist.
el: Αυτό το όνομα χρήστη δεν υπάρχει
nb_no: Dette brukernavnet eksisterer ikke.

# student_already_in_class
source: This student is already in your class.
el: Αυτός ο μαθητής είναι ήδη στη τάξη σου
nb_no: Denne eleven er allerede del av klassen din.

# student_already_invite
source: This student already has a pending invitation.
el: Αυτός ο μαθητής έχει ήδη μια πρόσκληση σε αναμονή
nb_no: Denne eleven har allerede fått en invitasjon. Har de glemt å svare?

# no_accounts
source: There are no accounts to create.
el: Δεν υπάρχουν λογαριασμοί για δημιουργία.
nb_no: Det er ingen oppgitte kontoer å opprette.

# unique_usernames
source: All usernames need to be unique.
el: Όλα τα ονόματα χρηστών πρέπει να είναι μοναδικά.
nb_no: Alle brukernavnene må være unike.

# usernames_exist
source: One or more usernames is already in use.
el: Ένα ή περισσότερα ονόματα χρηστών ήδη χρησιμοποιούνται.
nb_no: Et eller flere brukernavn er allerede i bruk.

# accounts_created
source: Accounts where successfully created.
el: Οι λογαριασμοί δημιουργήθηκαν με επιτυχία.
nb_no: Kontoene ble opprettet.

# retrieve_adventure_error
source: You're not allowed to view this adventure!
el: Δεν επιτρέπεται να δεις αυτήν την περιπέτεια!
nb_no: Du har ikke lov til å se dette eventyret!

# title_view-adventure
source: Hedy - View adventure
nb_no: Hedy - Se eventyr

# title_customize-adventure
source: Hedy - Customize adventure
nb_no: Hedy - Tilpass eventyr

# adventure_id_invalid
source: This adventure id is invalid.
el: Αυτό το αναγνωριστικό περιπέτειας δεν είναι έγκυρο
nb_no: Eventyr IDen er ugyldig.

# adventure_name_invalid
source: This adventure name is invalid.
el: Αυτό το όνομα περιπέτειας δεν είναι έγκυρο
nb_no: Eventyrnavnet er ugyldig.

# content_invalid
source: This adventure is invalid.
el: Αυτή η περιπέτεια δεν είναι έγκυρη
nb_no: Eventyret er ugyldig.

# adventure_length
source: Your adventure has to be at least 20 characters.
el: Η περιπέτειά σου πρέπει να είναι τουλάχιστον 20 χαρακτήρες
nb_no: Eventyret ditt må være minst 20 tegn.

# public_invalid
source: This agreement selection is invalid
el: Αυτή η επιλογή συμφωνίας δεν είναι έγκυρη
nb_no: Dette avtale valget er ugyldig

# adventure_duplicate
source: You already have an adventure with this name.
el: Έχεις ήδη μια περιπέτεια με αυτό το όνομα
nb_no: Du har allerede et eventyr med dette navnet.

# adventure_updated
source: The adventure has been updated!
el: Η περιπέτεια έχει ενημερωθεί!
nb_no: Eventyret har blitt oppdatert!

# adventure_empty
source: You didn't enter an adventure name!
el: Δεν έδωσες όνομα περιπέτειας!
nb_no: Du skrev ikke noe navn på eventyret!

source: Start quiz
el: Άρχισε το κουίζ

source: Hint?
el: Υπόδειξη?
