Repository: Felienne/hedy-web-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: el, nb_no

# program_contains_error
source: This program contains an error, are you sure you want to share it?
nb_no: Dette programmet inneholder en feil, er du sikker på at du vil dele det?

# title_achievements
source: Hedy - My achievements
nb_no: Hedy - Mine prestasjoner

# not_teacher
source: Looks like you are not a teacher!
el: Φαίνεται πως δεν είσαι καθηγητής!
nb_no: Ser ut til at du ikke er en lærer!

# not_enrolled
source: Looks like you are not in this class!
el: Φαίνεται πως δεν είστε σ' αυτήν την τάξη!
nb_no: Det ser ut som at du ikke er medlem i denne klassen!

# title_programs
source: Hedy - My programs
nb_no: Hedy - Mine programmer

# unauthorized
source: You don't have access rights for this page
nb_no: Du har ikke rettigheter til å se denne siden

# title_for-teacher
source: Hedy - For teachers
nb_no: Hedy - For lærere

# no_such_level
source: No such Hedy level!
el: Δεν υπάρχει τέτοιο επίπεδο Hedy!
nb_no: Dette Hedy nivået fins ikke!

# no_such_program
source: No such Hedy program!
el: Δεν υπάρχει τέτοιο πρόγραμμα Hedy!
nb_no: Dette Hedy programmet fins ikke!

# level_not_class
source: This level has not been made available in your class yet
el: Είσαι σε μια τάξη στην οποία δεν είναι ακόμα διαθέσιμο αυτό το επίπεδο
nb_no: Klassen din har ikke tilgang til dette nivået enda

# no_such_adventure
source: This adventure doesn't exist!
el: Αυτή η περιπέτεια δεν υπάρχει!
nb_no: Dette eventyret eksisterer ikke!

# page_not_found
source: We couldn't find that page!
el: Δεν μπορούμε να βρούμε αυτήν τη σελίδα!
nb_no: Vi klarte ikke å finne den siden!

# title_signup
source: Hedy - Create an account
nb_no: Hedy - Opprett konto

# title_login
source: Hedy - Login
nb_no: Hedy - Logg inn

# title_recover
source: Hedy - Recover account
nb_no: Hedy - Gjennopprett konto

# title_reset
source: Hedy - Reset password
nb_no: Hedy - Tilbakestill passord

# title_my-profile
source: Hedy - My account
nb_no: Hedy - Min konto

# title_learn-more
source: Hedy - Learn more
nb_no: Hedy - Lær mer

# title_privacy
source: Hedy - Privacy terms
nb_no: Hedy - Personvernsvilkår

# title_start
source: Hedy - A gradual programming language
nb_no: Hedy - Et gradvis programmeringsspråk

# title_landing-page
source: Welcome to Hedy!
nb_no: Velkommen til Hedy!

# title_explore
source: Hedy - Explore
nb_no: Hedy - Utforsk

# translate_error
source: Something went wrong while translating the code. Try running the code to see if it has an error. Code with errors can not be translated.
el: Κάτι πήγε στραβά κατά τη μετάφραση του κώδικα. Δοκίμασε να εκτελέσεις τον κώδικα για να δεις αν έχει κάποιο σφάλμα. Ο κώδικας με σφάλματα δεν μπορεί να μεταφραστεί.
nb_no: Noe gikk galt når vi prøvde å oversette koden. Prøv å kjøre koden for å se om den inneholder en feil. Kode med feil i kan ikke oversettes.

# ajax_error
source: There was an error, please try again.
el: Παρουσιάστηκε κάποιο σφάλμα, παρακαλώ ξαναπροσπάθησε.
nb_no: Det skjedde noe feil, vennligst prøv igjen.

# image_invalid
source: The image you chose image is invalid.
el: Η εικόνα σου δεν είναι έγκυρη
nb_no: Bildet du valgte er ugyldig.

# personal_text_invalid
source: Your personal text is invalid.
el: Το προσωπικό σου κείμενο δεν είναι έγκυρο
nb_no: Din personlige tekst er ugyldig.

# favourite_program_invalid
source: Your chosen favourite program is invalid.
el: Το αγαπημένο σου πρόγραμμα δεν είναι έγκυρο
nb_no: Ditt valgte favorittprogram er ugyldig.

source: Public profile updated.
el: Το δημόσιο προφίλ έχει ενημερωθεί.
nb_no: Din offentlige profil ble oppdatert.

# user_not_private
source: This user either doesn't exist or doesn't have a public profile
el: Αυτός ο χρήστης δεν υπάρχει ή δεν έχει δημόσιο προφίλ
nb_no: Denne brukeren eksisterer ikke, eller så har de ikke opprettet en offentlig profil

# invalid_teacher_invitation_code
source: The teacher invitation code is invalid. To become a teacher, reach out to hello@hedy.org.
el: Ο κωδικός πρόσκλησης καθηγητή δεν είναι έγκυρος. Για να γίνετε καθηγητής, απευθυνθείτε στο hello@hedy.org.
nb_no: Invitasjonskoden til å bli lærer er ugyldig. For å bli en Hedy-lærer, ta kontakt med hello@hedy.org. Felienne er fra Nederland, så skriv helst på engelsk.

# default_404
source: We could not find that page...
el: Δεν μπορούμε να βρούμε αυτήν την σελίδα...
nb_no: Vi klarte ikke finne den siden...

# default_403
source: Looks like you aren't authorized...
el: Μάλλον δεν είσαι εξουσιοδοτημένος/η...
nb_no: Ser ut til at du ikke har rettigheter til å gjøre det...

# default_500
source: Something went wrong...
el: Κάτι πήγε λάθος...
nb_no: Noe gikk galt...

# Wrong Level
source: That was correct Hedy code, but not at the right level. You wrote {offending_keyword} for level {working_level}. Tip: {tip}
el: Αυτός ήταν σωστός κώδικας Hedy, αλλά όχι στο σωστό επίπεδο. Έγραψες {offending_keyword} για το επίπεδο {working_level}. Υπόδειξη:{tip}
nb_no: Det var korrekt Hedy kode, men det var feil nivå. Du skrev {offending_keyword} for nivå {working_level}. Tips: {tip}

# Incomplete
source: Oops! You forgot a bit of code! On line {line_number}, you need to enter text behind {incomplete_command}.
el: Ουπς! Ξέχασες ένα κομμάτι κώδικα! Στη γραμμή {line_number}, πρέπει να γράψεις κείμενο ύστερα από την {incomplete_command}.
nb_no: Oisann! Du glemte litt kode! På linje {line_number}, må du legge til tekst etter {incomplete_command}.

# Invalid
source: {invalid_command} is not a Hedy level {level} command. Did you mean {guessed_command}?
el: Η εντολή {invalid_command} δεν είναι μια εντολή του επιπέδου {level} της Hedy. Μήπως εννοούσες {guessed_command};
nb_no: {invalid_command} er ikke en Hedy nivå {level} kommando. Mente du {guessed_command}?

# Invalid Space
source: Oops! You started a line with a space on line {line_number}. Spaces confuse computers, can you remove it?
el: Ουπς! Ξεκίνησες μια γραμμή με κενό στη γραμμή {line_number}. Τα κενά μπερδεύουν τους υπολογιστές, μπορείς να τα αφαιρέσεις;
nb_no: Oisann! Du begynte linjen med et mellomrom på linje {line_number}. Mellomrom forvirrer datamaskiner, kan du fjerne det?

# Has Blanks
source: Your code is incomplete. It contains blanks that you have to replace with code.
el: Ο κώδικάς σου δεν είναι πλήρης. Περιέχει κενά που πρέπει να αντικαταστήσεις με κώδικα.
nb_no: Koden din er uferdig. Den inneholder tomrom du må erstatte med kode.

# No Indentation
source: You used too few spaces in line {line_number}. You used {leading_spaces} spaces, which is not enough. Start every new block with {indent_size} spaces more than the line before.
el: Χρησιμοποίησες πολύ λίγα κενά στη γραμμή {line_number}. Χρησιμοποίησες {leading_spaces} κενά, τα οποία δεν είναι αρκετά. Ξεκίνα κάθε νέο μπλοκ με {indent_size} κενά περισσότερα από την προηγούμενη γραμμή.
nb_no: Du brukte for få mellomrom på linje {line_number}. Du brukte {leading_spaces} mellomrom, dette er ikke nok. Start hver nye kodeblokk med {indent_size} mellomrom mer enn linjen før.

# Unexpected Indentation
source: You used too many spaces in line {line_number}. You used {leading_spaces} spaces, which is too much. Start every new block with {indent_size} spaces more than the line before.
el: Χρησιμοποίησες πάρα πολλά κενά στη γραμμή {line_number}. Χρησιμοποίησες {leading_spaces} κενά, τα οποία είναι πάρα πολλά. Ξεκίνα κάθε νέο μπλοκ με {indent_size} κενά περισσότερα από την προηγούμενη γραμμή .
nb_no: Du brukte for mange mellomrom på linje {line_number}. Du brukte {leading_spaces} mellomrom, dette er for mange. Start hver nye kodeblokk med {indent_size} mellomrom mer enn linjen før.

# Parse
source: The code you entered is not valid Hedy code. There is a mistake on line {location[0]}, at position {location[1]}. You typed {character_found}, but that is not allowed.
el: Ο κώδικας που εισήγαγες δεν είναι έγκυρος κώδικας Hedy. Υπάρχει ένα σφάλμα στη γραμμή {location[0]}, στη θέση {location[1]}. Πληκτρολόγησες {character_found}, όμως αυτό δεν επιτρέπεται.
nb_no: Koden du skrev inn er ikke korrekt Hedy kode. Det er en feil på linje {location[0]}, på posisjon {location[1]}. Du skrev {character_found}, men det er ikke lov.

# Unquoted Text
source: Be careful. If you ask or print something, the text should start and finish with a quotation mark. You forgot that for the text {unquotedtext}.
el: Πρόσεξε. Όταν ζητάς ή εμφανίζεις κάτι, το κείμενο θα πρέπει να ξεκινάει και να τελειώνει με εισαγωγικά. Κάπου ξέχασες ένα.
nb_no: Vær forsiktig. Hvis du spør eller skriver ut noe så må du huske å begynne og avslutte teksten med en apostrof. Du glemte en apostrof en plass.

# Unquoted Assignment
source: From this level, you need to place texts to the right of the `is` between quotes. You forgot that for the text {text}.
el: Από αυτό το επίπεδο, πρέπει να τοποθετήσεις κείμενα στα δεξιά του `is` μέσα σε εισαγωγικά. Το ξέχασες για το κείμενο {text}.
nb_no: Fra dette nivået må du skrive teksten til høyre for `er`-kodeordet inni apostrofer. Du glemte det for teksten {text}.

# Unquoted Equality Check
source: If you want to check if a variable is equal to multiple words, the words should be surrounded by quotation marks!
el: Εάν θέλεις να ελέγξεις εάν μια μεταβλητή ισούται με πολλές λέξεις, οι λέξεις θα πρέπει να περιβάλλονται από εισαγωγικά!
nb_no: Hvis du har lyst til å sjekke om en variabel er lik flere ord, må ordene være inni to apostrofer. For eksempel 'her er ordene mine'!

# Var Undefined
source: You tried to use the variable {name}, but you didn't set it. It is also possible that you were trying to use the word {name} but forgot quotation marks.
el: Προσπάθησες να εμφανίσεις τη μεταβλητή {name}, όμως δεν την αρχικοποίησες. Είναι επίσης πιθανό ότι προσπαθούσες να χρησιμοποιήσεις τη λέξη {name} αλλά ξέχασες τα εισαγωγικά.
nb_no: Du prøvde å bruke variabelen {name}, men den finnes ikke. Det kan også være at du prøvde å bruke ordet {name} men at du glemte apostrof-tegnene.

# Cyclic Var Definition
source: The name {variable} needs to be set before you can use it on the right-hand side of the is command.
el: Το όνομα {variable} πρέπει να οριστεί για να μπορέσεις να το χρησιμοποιήσεις στη δεξιά πλευρά της εντολής is
nb_no: Variabelen {variable} må opprettes og gis en verdi før du kan bruke den på høyre siden av hvis-kommandoen

# Lonely Echo
source: You used an echo before an ask, or an echo without an ask. First ask for input, then echo.
el: Χρησιμοποίησες μια echo πριν από μια ask, ή μια echo χωρίς ask. Πρώτα ζήτησε εισαγωγή και μετά echo.
nb_no: Du brukte ekko før spør-kommandoen, eller ekko uten å bruke spør-kommandoen. Først må du spørre om inndata, så kan du bruke ekko.

# Too Big
source: Wow! Your program has an impressive {lines_of_code} lines of code! But we can only process {max_lines} lines in this level. Make your program smaller and try again.
el: Ουάου! Το πρόγραμμά σου έχει {lines_of_code} εντυπωσιακές γραμμές κώδικα! Αλλά μπορούμε να επεξεργαστούμε μόνο {max_lines} γραμμές σε αυτό το επίπεδο. Μείωσε το πρόγραμμά σου και δοκίμασε ξανά.
nb_no: Oi! Programmet ditt har {lines_of_code} kodelinjer, imponerende! Vi klarer desverre bare å prossessere {max_lines} linjer på dette nivået. Gjør programmet ditt mindre og prøv igjen.

# Invalid Argument Type
source: You cannot use {command} with {invalid_argument} because it is {invalid_type}. Try changing {invalid_argument} to {allowed_types}.
el: Δεν μπορείς να χρησιμοποιήσεις την εντολή {command} με το {invalid_argument} επειδή είναι {invalid_type}. Δοκίμασε να αλλάξεις το {invalid_argument} σε {allowed_types}.
nb_no: Du kan ikke bruke {command} med {invalid_argument} fordi det er {invalid_type}. Prøv å endre {invalid_argument} til {allowed_types}.

# Invalid Argument
source: You cannot use the command {command} with {invalid_argument}. Try changing {invalid_argument} to {allowed_types}.
el: Δεν μπορείς να χρησιμοποιήσεις την εντολή {command} με το {invalid_argument}. Δοκίμασε να αλλάξεις το {invalid_argument} σε {allowed_types}.
nb_no: Du kan ikke bruke kommandoen {command} med {invalid_argument}. Prøv å endre {invalid_argument} til {allowed_types}.

# Invalid Type Combination
source: You cannot use {invalid_argument} and {invalid_argument_2} with {command} because one is {invalid_type} and the other is {invalid_type_2}. Try changing {invalid_argument} to {invalid_type_2} or {invalid_argument_2} to {invalid_type}.
el: Δεν μπορείς να χρησιμοποιήσεις τα {invalid_argument} και {invalid_argument_2} στο {command} επειδή το ένα είναι {invalid_type} και το άλλο είναι {invalid_type_2}. Δοκίμασε να αλλάξεις το {invalid_argument} σε {invalid_type_2} ή το {invalid_argument_2} σε {invalid_type}.
nb_no: Du kan ikke bruke {invalid_argument} og {invalid_argument_2} i {command} fordi en er {invalid_type} og den andre er {invalid_type_2}. Prøv å endre {invalid_argument} til {invalid_type_2} eller {invalid_argument_2} til {invalid_type}.

# Unsupported Float
source: Non-integer numbers are not supported yet but they will be in a few levels. For now change {value} to an integer.
el: Οι μη ακέραιοι αριθμοί δεν υποστηρίζονται ακόμη, αλλά θα γίνει σε λίγα επίπεδα. Προς το παρόν άλλαξε το {value} σε έναν ακέραιο.
nb_no: Desimaltall er ikke støttet enda, men de er det om noen nivåer. Du må endre {value} til ett heltall på dette nivået.

# Locked Language Feature
source: You are using {concept}! That is awesome, but {concept} is not unlocked yet! It will be unlocked in a later level.
el: Χρησιμοποιείς το {concept}! Αυτό είναι φοβερό, αλλά το {concept} δεν έχει ξεκλειδωθεί ακόμα! Θα ξεκλειδωθεί σε μεταγενέστερο επίπεδο.
nb_no: Du bruker {concept}! Det er fantastisk, men {concept} er ikke låst opp enda! Det vil bli låst opp på et senere nivå.

# Missing Command
source: It looks like you forgot to use a command on line {line_number}.
el: Φαίνεται ότι ξέχασες να χρησιμοποιήσεις μια εντολή στη γραμμή {line_number}.
nb_no: Det ser ut som du glemte å bruke en kommando på linje line {line_number}.

# ask_needs_var
source: Starting in level 2, ask needs to be used with a variable. Example: name is ask What are you called?
el: Ξεκινώντας από το επίπεδο 2, το ask πρέπει να χρησιμοποιείται με μεταβλητή. Παράδειγμα: name is ask Πώς σε λένε;
nb_no: Fra nivå 2, må du lagre svaret fra spør-kommandoen i en variabel spørsmålet inni apostrofer. For eksempel: navn er spør Hva heter du?

# echo_out
source: Starting in level 2 echo is no longer needed. You can repeat an answer with ask and print now. Example: name is ask What are you called? printhello name
el: Ξεκινώντας το επίπεδο 2, η echo δεν χρειάζεται πλέον. Μπορείς να επαναλάβεις μια απάντηση με την ask και την print τώρα. Παράδειγμα: name is ask Πώς σε λένε; print γεια name
nb_no: Fra nivå 2 er ikke ekko nødvendig lenger. Du kan skrive ut svaret på et spørsmål med spør- og skriv-kommandoene. For eksempel: navn er spør Hva heter du? skriv hallo navn

# space
source: a space
el: ένα κενό
nb_no: et mellomrom

# comma
source: a comma
el: ένα κόμμα
nb_no: et komma

# question mark
source: a question mark
el: ένα ερωτηματικό
nb_no: et spørsmålstegn

# newline
source: a new line
el: μία νέα γραμμή
nb_no: en ny linje

# period
source: a period
el: μία τελεία
nb_no: et punktum

# exclamation mark
source: an exclamation mark
el: ένα θαυμαστικό
nb_no: et utropstegn

# dash
source: a dash
el: μία παύλα
nb_no: en bindestrek

# star
source: a star
el: ένας αστερίσκος
nb_no: en stjerne

# single quotes
source: a single quote
el: ένα μονό εισαγωγικό
nb_no: en enkelapostrof

source: double quotes
el: διπλά εισαγωγικά
nb_no: dobbelapostrof

# slash
source: a slash
el: μία κάθετος
nb_no: en skråstrek

# string
source: text
el: κείμενο
nb_no: tekst

# nested blocks
source: a block in a block
el: ένα μπλοκ μέσα σε ένα μπλοκ
nb_no: en blokk i en blokk

source: or
nb_no: eller

# number
source: a number
el: ένας αριθμός
nb_no: et tall

# integer
source: a number
el: ένας αριθμός
nb_no: et tall

# float
source: a number
el: έναν αριθμό
nb_no: et tall

# list
source: a list
el: μια λίστα
nb_no: en liste

# input
source: input from ask
el: είσοδος από την ask
nb_no: inndata fra spør-kommandoen

source: General
el: Γενικά
nb_no: Generelle Prestasjoner

source: Programs created
el: Προγράμματα που δημιουργήθηκαν
nb_no: Programmer laget

source: Programs saved
el: Αποθηκεύσεις Προγραμμάτων
nb_no: Lagring av programmer

source: Programs submitted
el: Υποβολές προγραμμάτων
nb_no: Innsendte programmer

source: Teacher
el: Καθηγητής
nb_no: Lærer

source: Hidden
el: Κρυμμένο
nb_no: Skjult

source: Hedy achievements
el: Επιτεύγματα Hedy
nb_no: Hedy Prestasjoner

# cheatsheet_title
source: Cheatsheet
nb_no: Skjul hjelpeark

# back_to_class
source: Go back to class
el: Επιστροφή στην τάξη
nb_no: Gå tilbake til klassen

# class_name_prompt
source: Please enter the name of the new class
el: Παρακαλώ δώσε το όνομα της τάξης
nb_no: Vennligst oppgi navnet på klassen

source: Username
el: Όνομα Χρήστη
nb_no: Brukernavn

source: Last login
el: Τελευταία είσοδος
nb_no: Forrige innlogging

source: Highest level reached
el: Το υψηλότερο επίπεδο που έφτασες
nb_no: Høyeste nivå nådd

# number_programs
source: Number of programs
el: Πλήθος προγραμμάτων
nb_no: Antall programmer

source: Programs
el: Προγράμματα
nb_no: Program

source: Password
el: Συνθηματικό
nb_no: Passord

source: Remove
el: Αφαίρεση
nb_no: Fjern

source: page
el: σελίδα
nb_no: side

# enter_password
source: Enter a new password for
el: Δώσε ένα συνθηματικό για
nb_no: Oppgi ett nytt passord for

# password_change_prompt
source: Are you sure you want to change this password?
el: Είσαι σίγουρος ότι θέλεις να αλλάξεις το συνθηματικό;
nb_no: Er du sikker på du vil endre dette passordet?

# remove_student_prompt
source: Are you sure you want to remove the student from the class?
el: Είσαι βέβαιος/α ότι θέλεις να αφαιρέσεις τον μαθητή από την τάξη;
nb_no: Er du sikker du vil fjerne eleven fra klassen?

source: Customize class
el: Προσαρμογή της τάξης
nb_no: Tilpass innstillingene for klassen

# class_stats
source: Class statistics
el: Εμφάνιση στατιστικών στοιχείων της τάξης
nb_no: Statistikk over klassen

# back_to_teachers_page
source: Go back to teachers page
el: Επιστροφή στη σελίδα καθηγητή
nb_no: Gå tilbake til lærersiden

# invite_prompt
source: Enter a username
el: Δώσε όνομα χρήστη
nb_no: Oppgi et brukernavn

source: Create accounts
el: Δημιουργία πολλών λογαριασμών
nb_no: Opprett flere kontoer

source: Pending invites
el: Εκκρεμείς προσκλήσεις
nb_no: Ubesvarte invitasjoner

source: Invite date
el: Ημερομηνία πρόσκλησης
nb_no: Invitasjonsdato

source: Expiration date
nb_no: Utløpsdato

# delete_invite_prompt
source: Are you sure you want to remove this class invitation?
el: Είσαι βέβαιος ότι θέλεις να καταργήσεις αυτήν την πρόσκληση τάξης;
nb_no: Er du sikker på at du vil fjerne denne klasseinvitasjonen?

# class_already_joined
source: You are already a student of class
el: Είσαι ήδη μαθητής της τάξης
nb_no: Du er allerede elev i denne klassen

# goto_profile
source: Go to my profile
el: Πήγαινε στο προφίλ μου
nb_no: Gå til min profil

# prompt_join_class
source: Do you want to join this class?
el: Θέλεις να συμμετάσχεις στην τάξη;
nb_no: Vil du bli med i denne klassen?

# join_prompt
source: You need to have an account to join a class. Would you like to login now?
el: Πρέπει να έχεις λογαριασμό για να συμμετάσχεις σε μια τάξη. Θέλεις να συνδεθείς τώρα;
nb_no: Du trenger en konto for å bli med i klassen. Vil du logge inn nå?

source: Join class
el: Συμμετοχή σε τάξη
nb_no: Bli med i klassen

# level_title
source: Level
el: Επίπεδο
nb_no: Nivå

source: Create multiple accounts
nb_no: Opprett flere kontoer

# accounts_intro
source: On this page you can create accounts for multiple students at the same time. There are autoamtically added to the current class, make sure the selected class is correct!. By pressing the green + on the bottom right of the page you can add extra rows. You can delete a row by pressing the corresponding red cross. Make sure no rows are empty when you press "Create accounts". Please keep in mind that every username needs to be unique and the password needs to be <b>at least</b> 6 characters.
el: Σε αυτή τη σελίδα μπορείς να δημιουργήσεις λογαριασμούς για πολλούς μαθητές ταυτόχρονα. Είναι επίσης δυνατό να τους προσθέσεις απευθείας σε μία από τις τάξεις σου. Πατώντας το πράσινο + κάτω δεξιά στη σελίδα μπορείς να προσθέσεις επιπλέον σειρές. Μπορείς να διαγράψεις μια σειρά πατώντας τον αντίστοιχο κόκκινο σταυρό. Βεβαιώσου ότι δεν υπάρχουν κενές σειρές όταν πατάς "Δημιουργία λογαριασμών". Λάβε υπόψη ότι κάθε όνομα χρήστη και διεύθυνση mail πρέπει να είναι μοναδικά και το συνθηματικό πρέπει να έχει <b>τουλάχιστον</b> 6 χαρακτήρες.
nb_no: På denne siden kan du opprette kontoer for flere elever samtidig. Det er også mulig å legge de til i en av klassene dine. Ved å trykke på den grønnne + knappen til høyre på bunnen av skjermen kan du legge til ekstra rader. Du kan slette rader ved å trykke på det tilsvarende røde krysset. Pass på at ingen rader er tomme når du trykker på "Opprett kontoer". Vennligst pass på at hvert brukernavn og epost er unik og at passordet er <b>minst</b> 6 tegn.

# create_accounts_prompt
source: Are you sure you want to create these accounts?
el: Είσαι σίγουρος ότι θέλεις να δημιουργήσεις αυτούς τους λογαριασμούς;
nb_no: Er du sikker på at du vil opprette disse kontoene?

source: Yes
el: Ναι
nb_no: Ja

source: No
el: Όχι
nb_no: Nei

# reset_view
source: Reset
el: Επαναφορά
nb_no: Tilbakestill

source: Customize adventure
el: Προσαρμογή περιπέτειας
nb_no: Tilpass eventyr

# update_adventure_prompt
source: Are you sure you want to update this adventure?
el: Είσαι σίγουρος ότι θέλεις να ενημερώσεις την περιπέτεια;
nb_no: Er du sikker på at du vil oppdatere dette eventyret?

source: General settings
el: Γενικές ρυθμίσεις
nb_no: Generelle innstillinger

source: Name
el: Όνομα
nb_no: Navn

source: Level
el: Επίπεδο
nb_no: Nivå

# adventure_exp_1
source: Type your adventure of choice on the right-hand side. After creating your adventure you can include it in one of your classes under "customizations". If you want to include a command in your adventure please use code anchors like this:
el: Πληκτρολόγησε την περιπέτεια της επιλογής σου στη δεξιά πλευρά. Αφού δημιουργήσεις την περιπέτειά σου, μπορείς να τη συμπεριλάβεις σε μία από τις τάξεις σου στην ενότητα "προσαρμογές". Αν θέλεις να συμπεριλάβεις μια εντολή στην περιπέτειά σου, χρησιμοποίησε άγκυρες κώδικα όπως αυτή:
nb_no: Skriv inn ditt ønskede eventyr på høyre side. Etter du har laget et eventyr kan du inkludere det i en av klassene dine under "tilpasninger". Hvis du vil inkludere en kommando i eventyret vennligst bruk kodeblokker som dette:

# adventure_exp_2
source: If you want to show actual code snippets, for example to give student a template or example of the code. Please use pre anchors like this:
el: Εάν θέλεις να εμφανίσεις πραγματικά αποσπάσματα κώδικα, για παράδειγμα για να δώσεις στον μαθητή ένα πρότυπο ή παράδειγμα του κώδικα. Χρησιμοποίησε προηγούμενες άγκυρες όπως αυτή:
nb_no: Hvis du vil vise en kodesnuttet, for eksempel for å gi en elev en mal eller kodeeksempel, bruk pre-tag som dette:

# adventure_exp_3
source: Make sure you always surround keywords with { }, then they are recognized correctly. You can use the "preview" button to view a styled version of your adventure. To view the adventure on a dedicated page, select "view" from the teachers page.
el: Μπορείς να χρησιμοποιήσεις το κουμπί "προεπισκόπηση" για να δεις μια στυλιζαρισμένη έκδοση της περιπέτειάς σου. Για να δεις την περιπέτεια σε μια ειδική σελίδα, επίλεξε "προβολή" από τη σελίδα καθηγητών.
nb_no: Du kan bruke "forhåndsvis" knappen til å se en stilert versjon av eventyret ditt. For å se eventyret på en egen side, velg "vis" fra lærersiden.

source: Adventure
el: Περιπέτεια
nb_no: Eventyr
